### Report for degrades-dashboards on environment: dev

#### Terraform Format and Style 🖌`success`
<details><summary>Format Output</summary>

```


```

</details>

#### Terraform Initialization ⚙️`success`
<details><summary>Initialization Output</summary>

```

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.
Initializing provider plugins...
- Finding hashicorp/aws versions matching "~> 5.0"...
- Installing hashicorp/aws v5.100.0...
- Installed hashicorp/aws v5.100.0 (signed by HashiCorp)
Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

```

</details>

#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan (20 to add, 1 to change, 5 to destroy)</summary>

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.degrade_message_receiver_lambda_logging will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "degrade_message_receiver_lambda_logging" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
    }

  # data.aws_iam_policy_document.degrades_message_table_access will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "degrades_message_table_access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "dynamodb:BatchGetItem",
              + "dynamodb:BatchWriteItem",
              + "dynamodb:ConditionCheckItem",
              + "dynamodb:DeleteItem",
              + "dynamodb:DescribeTable",
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:Query",
              + "dynamodb:Scan",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # data.aws_iam_policy_document.degrades_messages_sqs_receive will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "degrades_messages_sqs_receive" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "sqs:GetQueueAttributes",
              + "sqs:GetQueueUrl",
              + "sqs:ReceiveMessage",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # aws_api_gateway_integration.degrades_get will be updated in-place
  ~ resource "aws_api_gateway_integration" "degrades_get" {
        id                      = "agi-k9agkrdrn4-ll4uf2-GET"
      ~ uri                     = "arn:aws:apigateway:eu-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-west-2:343515223843:function:dev_degrades_dashboards_lambda/invocations" -> (known after apply)
        # (15 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_group.degrades_messages_receiver will be created
  + resource "aws_cloudwatch_log_group" "degrades_messages_receiver" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/dev_degrades_message_receiver_lambda"
      + name_prefix       = (known after apply)
      + retention_in_days = 14
      + skip_destroy      = false
      + tags_all          = (known after apply)
    }

  # aws_cloudwatch_metric_alarm.degrades_dlq_new_message will be created
  + resource "aws_cloudwatch_metric_alarm" "degrades_dlq_new_message" {
      + actions_enabled                       = true
      + alarm_description                     = "Alarm for when there are new messages on the Degrades Message DLQ"
      + alarm_name                            = "degrades_dlq_message_alarm_dev"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "QueueName" = "degrades_messages_deadletter_queue"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "ApproximateNumberOfMessagesVisible"
      + namespace                             = "AWS/SQS"
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 0
      + treat_missing_data                    = "missing"
    }

  # aws_dynamodb_table.degrades_message_table will be created
  + resource "aws_dynamodb_table" "degrades_message_table" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "Timestamp"
      + id               = (known after apply)
      + name             = "degrades_message_table_dev"
      + range_key        = "MessageId"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags_all         = (known after apply)
      + write_capacity   = (known after apply)

      + attribute {
          + name = "MessageId"
          + type = "S"
        }
      + attribute {
          + name = "Timestamp"
          + type = "N"
        }

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)
    }

  # aws_iam_policy.degrades_lambda_sqs_invoke will be created
  + resource "aws_iam_policy" "degrades_lambda_sqs_invoke" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "degrades_sqs_invoke_policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # aws_iam_policy.degrades_message_receiver_logging will be created
  + resource "aws_iam_policy" "degrades_message_receiver_logging" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "IAM policy for logging from a lambda"
      + id               = (known after apply)
      + name             = "degrades_message_receiver_lambda_logging"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # aws_iam_policy.degrades_message_table_access will be created
  + resource "aws_iam_policy" "degrades_message_table_access" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "degrades_table_access_policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # aws_iam_policy.read_registrations_mi_events must be replaced
-/+ resource "aws_iam_policy" "read_registrations_mi_events" {
      ~ arn              = "arn:aws:iam::343515223843:policy/dev-degrades_dashboards_lambda" -> (known after apply)
      ~ attachment_count = 1 -> (known after apply)
      ~ id               = "arn:aws:iam::343515223843:policy/dev-degrades_dashboards_lambda" -> (known after apply)
      ~ name             = "dev-degrades_dashboards_lambda" -> "dev-degrades_api_dashboards_lambda" # forces replacement
      + name_prefix      = (known after apply)
      ~ policy_id        = "ANPAU76Y2K4RRIK3QDD4R" -> (known after apply)
      - tags             = {} -> null
      ~ tags_all         = {} -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_iam_role.degrades_api_lambda_role will be created
  + resource "aws_iam_role" "degrades_api_lambda_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dev_degrades_api_lambda_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role.degrades_lambda_role will be destroyed
  # (because aws_iam_role.degrades_lambda_role is not in configuration)
  - resource "aws_iam_role" "degrades_lambda_role" {
      - arn                   = "arn:aws:iam::343515223843:role/dev_degrades_lambda_role" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2025-06-09T11:26:10Z" -> null
      - force_detach_policies = false -> null
      - id                    = "dev_degrades_lambda_role" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::343515223843:policy/dev-degrades_dashboards_lambda",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "dev_degrades_lambda_role" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROAU76Y2K4RRXVVFOX67" -> null
        # (3 unchanged attributes hidden)
    }

  # aws_iam_role.degrades_message_receiver_lambda will be created
  + resource "aws_iam_role" "degrades_message_receiver_lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "degrades_message_receiver_lambda_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy_attachment.degrades_api_lambda_s3_read will be created
  + resource "aws_iam_role_policy_attachment" "degrades_api_lambda_s3_read" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "dev_degrades_api_lambda_role"
    }

  # aws_iam_role_policy_attachment.degrades_lambda_s3_read will be destroyed
  # (because aws_iam_role_policy_attachment.degrades_lambda_s3_read is not in configuration)
  - resource "aws_iam_role_policy_attachment" "degrades_lambda_s3_read" {
      - id         = "dev_degrades_lambda_role-20250611153157049400000001" -> null
      - policy_arn = "arn:aws:iam::343515223843:policy/dev-degrades_dashboards_lambda" -> null
      - role       = "dev_degrades_lambda_role" -> null
    }

  # aws_iam_role_policy_attachment.degrades_lambda_sqs_invoke will be created
  + resource "aws_iam_role_policy_attachment" "degrades_lambda_sqs_invoke" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "degrades_message_receiver_lambda_role"
    }

  # aws_iam_role_policy_attachment.degrades_message_receiver_lambda_dynamodb will be created
  + resource "aws_iam_role_policy_attachment" "degrades_message_receiver_lambda_dynamodb" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "degrades_message_receiver_lambda_role"
    }

  # aws_iam_role_policy_attachment.lambda_logs will be created
  + resource "aws_iam_role_policy_attachment" "lambda_logs" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "degrades_message_receiver_lambda_role"
    }

  # aws_lambda_event_source_mapping.degrades_lambda will be created
  + resource "aws_lambda_event_source_mapping" "degrades_lambda" {
      + arn                           = (known after apply)
      + enabled                       = true
      + event_source_arn              = (known after apply)
      + function_arn                  = (known after apply)
      + function_name                 = (known after apply)
      + id                            = (known after apply)
      + last_modified                 = (known after apply)
      + last_processing_result        = (known after apply)
      + maximum_record_age_in_seconds = (known after apply)
      + maximum_retry_attempts        = (known after apply)
      + parallelization_factor        = (known after apply)
      + state                         = (known after apply)
      + state_transition_reason       = (known after apply)
      + tags_all                      = (known after apply)
      + uuid                          = (known after apply)

      + amazon_managed_kafka_event_source_config (known after apply)

      + self_managed_kafka_event_source_config (known after apply)
    }

  # aws_lambda_function.degrades_api_lambda will be created
  + resource "aws_lambda_function" "degrades_api_lambda" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "lambda/build/degrades-api-dashboards.zip"
      + function_name                  = "dev_degrades_api_dashboards_lambda"
      + handler                        = "main.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 512
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "RTZfdsYbWqmb3QD4IW+8AuR1V4L5To+pW4Vs1rsiHZg="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 45
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "REGISTRATIONS_MI_EVENT_BUCKET" = "prm-gp-registrations-mi-events-dev"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # aws_lambda_function.degrades_lambda will be destroyed
  # (because aws_lambda_function.degrades_lambda is not in configuration)
  - resource "aws_lambda_function" "degrades_lambda" {
      - architectures                  = [
          - "x86_64",
        ] -> null
      - arn                            = "arn:aws:lambda:eu-west-2:343515223843:function:dev_degrades_dashboards_lambda" -> null
      - code_sha256                    = "sxaqq6CC4W2MOSiVZI1f3s/eSzSzVe9ryvyLkT1Z0r8=" -> null
      - filename                       = "/home/runner/work/prm-gp2gp-data-pipeline-infra/prm-gp2gp-data-pipeline-infra/lambda/build/degrades-dashboards.zip" -> null
      - function_name                  = "dev_degrades_dashboards_lambda" -> null
      - handler                        = "main.lambda_handler" -> null
      - id                             = "dev_degrades_dashboards_lambda" -> null
      - invoke_arn                     = "arn:aws:apigateway:eu-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-west-2:343515223843:function:dev_degrades_dashboards_lambda/invocations" -> null
      - last_modified                  = "2025-06-12T12:44:19.000+0000" -> null
      - layers                         = [] -> null
      - memory_size                    = 512 -> null
      - package_type                   = "Zip" -> null
      - publish                        = false -> null
      - qualified_arn                  = "arn:aws:lambda:eu-west-2:343515223843:function:dev_degrades_dashboards_lambda:$LATEST" -> null
      - qualified_invoke_arn           = "arn:aws:apigateway:eu-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-west-2:343515223843:function:dev_degrades_dashboards_lambda:$LATEST/invocations" -> null
      - reserved_concurrent_executions = -1 -> null
      - role                           = "arn:aws:iam::343515223843:role/dev_degrades_lambda_role" -> null
      - runtime                        = "python3.12" -> null
      - skip_destroy                   = false -> null
      - source_code_hash               = "lEhOjbS6uCkFwIR6vItgZNjmB4lqwjqRoVapLTvgX9A=" -> null
      - source_code_size               = 35864863 -> null
      - tags                           = {} -> null
      - tags_all                       = {} -> null
      - timeout                        = 900 -> null
      - version                        = "$LATEST" -> null
        # (6 unchanged attributes hidden)

      - environment {
          - variables = {
              - "REGISTRATIONS_MI_EVENT_BUCKET" = "prm-gp-registrations-mi-events-dev"
            } -> null
        }

      - ephemeral_storage {
          - size = 512 -> null
        }

      - logging_config {
          - log_format            = "Text" -> null
          - log_group             = "/aws/lambda/dev_degrades_dashboards_lambda" -> null
            # (2 unchanged attributes hidden)
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }
    }

  # aws_lambda_function.degrades_message_receiver will be created
  + resource "aws_lambda_function" "degrades_message_receiver" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "./lambda/build/degrades-message-receiver.zip"
      + function_name                  = "dev_degrades_message_receiver_lambda"
      + handler                        = "main.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "nygcT8EBq5yaXqI+W4iVqeBL6iCkdwF4pQKpCyASyy0="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 45
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "AWS_REGION"             = "eu-west-2"
              + "DEGRADES_MESSAGE_TABLE" = "degrades_message_table_dev"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # aws_lambda_permission.lambda_permission must be replaced
-/+ resource "aws_lambda_permission" "lambda_permission" {
      ~ function_name       = "dev_degrades_dashboards_lambda" -> "dev_degrades_api_dashboards_lambda" # forces replacement
      ~ id                  = "terraform-20250611105507830800000001" -> (known after apply)
      ~ statement_id        = "terraform-20250611105507830800000001" -> (known after apply)
      ~ statement_id_prefix = "terraform-" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_sqs_queue.degrades_messages will be created
  + resource "aws_sqs_queue" "degrades_messages" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 345600
      + name                              = "degrades_messages_queue"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = (known after apply)
      + tags_all                          = (known after apply)
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

  # aws_sqs_queue.degrades_messages_deadletter will be created
  + resource "aws_sqs_queue" "degrades_messages_deadletter" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 345600
      + name                              = "degrades_messages_deadletter_queue"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = (known after apply)
      + tags_all                          = (known after apply)
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

  # aws_sqs_queue_redrive_allow_policy.degrades_message_queue_redrive_allow_policy will be created
  + resource "aws_sqs_queue_redrive_allow_policy" "degrades_message_queue_redrive_allow_policy" {
      + id                   = (known after apply)
      + queue_url            = (known after apply)
      + redrive_allow_policy = (known after apply)
    }

Plan: 20 to add, 1 to change, 5 to destroy.

```

</details>